12/data/attachments/e7726867182ac960.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fd25bb4d-253c-4c0f-9cdd-228e9f773737</nif:username>
            <nif:friendToBeAdded>Kimberly_how_Friend_40439_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>